///////////////////////////////////////////////////////////////////////////////////////////////////////
// Copyright (c) 2022-2025, ООО 1С-Рарус
// Все права защищены. Эта программа и сопроводительные материалы предоставляются
// в соответствии с условиями лицензии Attribution-ShareAlike 4.0 International (CC BY-SA 4.0)
// Текст лицензии доступен по ссылке:
// https://creativecommons.org/licenses/by-sa/4.0/legalcode
///////////////////////////////////////////////////////////////////////////////////////////////////////

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если ТолькоПросмотр Тогда
		
		ПоложениеКоманднойПанели = ПоложениеКоманднойПанелиФормы.Нет;
		
		Элементы.ПодобныеЗапросы.ПоложениеКоманднойПанели = ПоложениеКоманднойПанелиЭлементаФормы.Нет;
		Элементы.ПодобныеЗапросы.ИзменятьСоставСтрок      = ЛОЖЬ;
		Элементы.ПодобныеЗапросы.ТолькоПросмотр           = ИСТИНА;
		
	КонецЕсли;
	
	ЭтоНовый = ПустаяСтрока(Запись.ИсходныйКлючЗаписи.Идентификатор);
	
	Если НЕ ЭтоНовый Тогда
		Возврат;
	КонецЕсли;
	
	Элементы.СтраницаПодобныеЗапросы.Доступность = ЛОЖЬ;
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	АвтоЗаголовок = ЛОЖЬ;
	Заголовок     = СтрШаблон(НСтр("ru = '%2: %1%3'"), Запись.Сервис, Запись.Метод, Запись.Ресурс);
	
	ПоказатьПодобныеЗапросы = НЕ ПустаяСтрока(Запись.КлючИдемпотентности);
	Элементы.СтраницаПодобныеЗапросы.Доступность = ПоказатьПодобныеЗапросы;
	
	Если ПоказатьПодобныеЗапросы Тогда
		
		кв_ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(ПодобныеЗапросы.Отбор, "Идентификатор",
			Запись.Идентификатор, ВидСравненияКомпоновкиДанных.НеРавно);
			
		кв_ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(ПодобныеЗапросы.Отбор, "Сервис", Запись.Сервис);
		
		кв_ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(ПодобныеЗапросы.Отбор, "КлючИдемпотентности",
			Запись.КлючИдемпотентности);
		
	Иначе 
		
		кв_ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(ПодобныеЗапросы.Отбор, "Сервис", Неопределено);
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ОткрытьОПрограмме(Команда)
	
	ОткрытьФорму("Справочник.кв_Сервисы.Форма.ОПрограмме",, ЭтотОбъект);
	
КонецПроцедуры

#КонецОбласти
