///////////////////////////////////////////////////////////////////////////////////////////////////////
// Copyright (c) 2022-2025, ООО 1С-Рарус
// Все права защищены. Эта программа и сопроводительные материалы предоставляются
// в соответствии с условиями лицензии Attribution-ShareAlike 4.0 International (CC BY-SA 4.0)
// Текст лицензии доступен по ссылке:
// https://creativecommons.org/licenses/by-sa/4.0/legalcode
///////////////////////////////////////////////////////////////////////////////////////////////////////

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("РежимВыбора") И Параметры.РежимВыбора = ИСТИНА Тогда
		
		Элементы.Список.РежимВыбора    = ИСТИНА;
		Элементы.Список.РежимВыделения = РежимВыделенияТаблицы.Одиночный;
		
		ЭтотОбъект.КлючСохраненияПоложенияОкна = СтрШаблон(НСтр("ru = '%1.РежимВыбора'"), Список.ОсновнаяТаблица);
		ЭтотОбъект.КлючНазначенияИспользования = ЭтотОбъект.КлючСохраненияПоложенияОкна;
		ЭтотОбъект.РежимОткрытияОкна           = РежимОткрытияОкнаФормы.БлокироватьОкноВладельца;
		
		ЭтотОбъект.Список.АвтоматическоеСохранениеПользовательскихНастроек = ЛОЖЬ;
		
	КонецЕсли
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ОткрытьОПрограмме(Команда)
	
	ОткрытьФорму("Справочник.кв_Сервисы.Форма.ОПрограмме",, ЭтотОбъект);
	
КонецПроцедуры

#КонецОбласти
