
#Область ОбработчикиСобытий

Процедура ПриЗаписи(Отказ)
	
	СписокРегламентныхЗаданий = РегламентныеЗаданияПодсистемы();
	
	Для каждого Задание Из СписокРегламентныхЗаданий Цикл
		Если Задание.Использование <> Значение Тогда
			Задание.Использование = Значение;
			Задание.Записать();
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция РегламентныеЗаданияПодсистемы()
	
	РазблокированиеКонфликтовHTTPЗапросов = РегламентныеЗадания.НайтиПредопределенное(
		Метаданные.РегламентныеЗадания.кв_РазблокированиеКонфликтовHTTPЗапросов);
	
	СокращениеЖурналовHTTPЗапросов = РегламентныеЗадания.НайтиПредопределенное(
		Метаданные.РегламентныеЗадания.кв_СокращениеЖурналовHTTPЗапросов);
	
	СписокРегламентныхЗаданий = Новый Массив;
	СписокРегламентныхЗаданий.Добавить(РазблокированиеКонфликтовHTTPЗапросов);
	СписокРегламентныхЗаданий.Добавить(СокращениеЖурналовHTTPЗапросов);
	
	Возврат СписокРегламентныхЗаданий;
	
КонецФункции

#КонецОбласти