///////////////////////////////////////////////////////////////////////////////////////////////////////
// Copyright (c) 2022-2025, ООО 1С-Рарус
// Все права защищены. Эта программа и сопроводительные материалы предоставляются
// в соответствии с условиями лицензии Attribution-ShareAlike 4.0 International (CC BY-SA 4.0)
// Текст лицензии доступен по ссылке:
// https://creativecommons.org/licenses/by-sa/4.0/legalcode
//////////////////////////////////////////////////////////////////////////////////////////////////////

#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныйПрограммныйИнтерфейс

// Возвращает партнера по ИНН.
//
// Параметры:
//  ИНН	 - Строка - ИНН партнера.
// 
// Возвращаемое значение:
//   - СправочникСсылка.кв_Партнеры - партнер.
//
Функция ПартнерПоИНН(ИНН) Экспорт
	
	Партнер = Неопределено;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ИНН", ИНН);
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	_ДемоПартнеры.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник._ДемоПартнеры КАК _ДемоПартнеры
	|ГДЕ
	|	_ДемоПартнеры.ИНН = &ИНН
	|	И НЕ _ДемоПартнеры.ПометкаУдаления";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Если Выборка.Следующий() Тогда
		Партнер = Выборка.Ссылка;	
	КонецЕсли;

	Возврат Партнер;
	
КонецФункции

#КонецОбласти

#КонецЕсли