#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	кв_ОбщегоНазначенияКлиентСервер.ОтформатироватьНаименованиеШаблонаСервиса(Наименование);
	
	СпособЛогированияПоУмолчанию = Перечисления.кв_СпособыЛогирования.СпособЛогированияПоУмолчанию();
	
	Для Каждого СтрокаТЧ Из Методы Цикл
		
		Если Не ЗначениеЗаполнено(СтрокаТЧ.СпособЛогирования) Тогда
			
			СтрокаТЧ.СпособЛогирования = СпособЛогированияПоУмолчанию;
			
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	ПроверитьНаличиеРанееСозданногоШаблона(Отказ);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ПроверитьНаличиеРанееСозданногоШаблона(Отказ)
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	кв_ШаблоныСервисов.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.кв_ШаблоныСервисов КАК кв_ШаблоныСервисов
	|ГДЕ
	|	НЕ кв_ШаблоныСервисов.ПометкаУдаления
	|	И Не кв_ШаблоныСервисов.Ссылка = &Ссылка
	|	И кв_ШаблоныСервисов.Владелец = &Владелец
	|	И кв_ШаблоныСервисов.Наименование = &Наименование";
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	Запрос.УстановитьПараметр("Владелец", Владелец);
	Запрос.УстановитьПараметр("Наименование", Наименование);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если Не РезультатЗапроса.Пустой() Тогда
		Отказ = Истина;
		кв_ОбщегоНазначенияКлиентСервер.СообщитьПользователю("По указанным параметрам ранее был создан шаблон. Запись шаблона невозможна");
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
