///////////////////////////////////////////////////////////////////////////////////////////////////////
// Copyright (c) 2022-2025, ООО 1С-Рарус
// Все права защищены. Эта программа и сопроводительные материалы предоставляются
// в соответствии с условиями лицензии Attribution-ShareAlike 4.0 International (CC BY-SA 4.0)
// Текст лицензии доступен по ссылке:
// https://creativecommons.org/licenses/by-sa/4.0/legalcode
//////////////////////////////////////////////////////////////////////////////////////////////////////

#Область ОбработчикиСобытий

&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	Ключ = "кв_СокращениеЖурналовHTTPЗапросов";
	Расписание = ПолучитьРасписаниеНаСервере(Ключ);
	
	Если Расписание = Неопределено Тогда
		ТекстСообщения = НСтр("ru = 'Регламентное задание не обнаружено!'");
		кв_ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
		Возврат;
	КонецЕсли; 
	
	ДополнительныеПараметры = Новый Структура("Ключ", Ключ);
	Оповещение = Новый ОписаниеОповещения("РегламентноеЗадание_ПриЗакрытии", ЭтотОбъект, ДополнительныеПараметры);
	
	Диалог = Новый ДиалогРасписанияРегламентногоЗадания(Расписание);  		
	Диалог.Показать(Оповещение);	
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

&НаКлиенте
Процедура РегламентноеЗадание_ПриЗакрытии(Расписание, ДополнительныеПараметры) Экспорт
	
	Если Расписание = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ИзменитьРасписаниеНаСервере(Расписание, ДополнительныеПараметры.Ключ)
	
КонецПроцедуры                        

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Функция ПолучитьРасписаниеНаСервере(Ключ) Экспорт
	
	РегламентноеЗадание = РегламентныеЗадания.НайтиПредопределенное(Ключ);
	
	Возврат РегламентноеЗадание.Расписание;
	
КонецФункции

&НаСервере
Процедура ИзменитьРасписаниеНаСервере(Расписание, Ключ)

	Использование = Константы.кв_ИспользоватьРегламентныеЗадания.Получить();
	
	РегламентноеЗадание = РегламентныеЗадания.НайтиПредопределенное(Ключ);
		
	РегламентноеЗадание.Расписание = Расписание;
	РегламентноеЗадание.Использование = Использование;
	РегламентноеЗадание.Записать();
		
КонецПроцедуры 

#КонецОбласти