
#Область ОбработчикиСобытийФормы

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия = "Запись_кв_ШаблоныСервисов" Тогда
		Элементы.Список.Обновить();
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыСписок

&НаКлиенте
Процедура СписокВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	ТекущиеДанные = Элемент.ТекущиеДанные;
	
	Если ТекущиеДанные <> Неопределено Тогда
		
		СтандартнаяОбработка = Ложь;
		
		ПоказатьЗначение(, ТекущиеДанные.Ссылка);
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Создать(Команда)
	
	ОткрытьФорму("Справочник.кв_ШаблоныСервисов.ФормаОбъекта");
	
КонецПроцедуры

&НаКлиенте
Процедура Скопировать(Команда)
	
	ТекущиеДанные = Элементы.Список.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ПараметрыФормы = Новый Структура;
	ЗначениеКопирования = ТекущиеДанные.Ссылка;
	ПараметрыФормы.Вставить("ЗначениеКопирования", ЗначениеКопирования);
	
	ОткрытьФорму("Справочник.кв_ШаблоныСервисов.ФормаОбъекта", ПараметрыФормы);
	
КонецПроцедуры

&НаКлиенте
Асинх Процедура ПометитьНаУдаление(Команда)
	
	ТекущиеДанные = Элементы.Список.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ВыделенныеСтроки = Элементы.Список.ВыделенныеСтроки;
	
	Шаблоны = Новый Массив;
	
	Для Каждого ВыделеннаяСтрока Из ВыделенныеСтроки Цикл
		
		ДанныеСтроки = Элементы.Список.ДанныеСтроки(ВыделеннаяСтрока);
		
		Если ДанныеСтроки <> Неопределено Тогда
			Шаблоны.Добавить(ДанныеСтроки.Ссылка);
		КонецЕсли;
		
	КонецЦикла;
	
	Пометка = ПометкаУдаления(Шаблоны);
	
	Если Шаблоны.Количество() = 1 Тогда
		Если Пометка Тогда
			ТекстВопроса = СтрШаблон(
				НСтр("ru = 'Снять с ""%1"" пометку на удаление?'"),
				Строка(ТекущиеДанные.Ссылка));
		Иначе
			ТекстВопроса = СтрШаблон(
				НСтр("ru = 'Пометить ""%1"" на удаление?'"),
				Строка(ТекущиеДанные.Ссылка));
		КонецЕсли;
	Иначе
		Если Пометка Тогда
			ТекстВопроса = НСтр("ru = 'Снять с выделенных элементов пометку на удаление?'");
		Иначе
			ТекстВопроса = НСтр("ru = 'Пометить выделенные элементы на удаление?'");
		КонецЕсли;
	КонецЕсли;
	
	Ответ = Ждать ПоказатьВопросДаНетАсинх(
		ТекстВопроса,
		ПараметрыВопросаДаНет(КодВозвратаДиалога.Да));
	
	Если Ответ = КодВозвратаДиалога.Да Тогда
		ПометитьНаУдалениеСнятьПометкуНаСервере(
			Шаблоны,
			Пометка);
		
		Элементы.Список.Обновить();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьПоСервису(Команда)
	
	ОписаниеВыбора = Новый ОписаниеОповещения("ОбработатьВыборСервиса", ЭтотОбъект);
	
	ПараметрыОткрытия = Новый Структура;
	ПараметрыОткрытия.Вставить("РежимВыбора", Истина);
	
	ОткрытьФорму("Справочник.кв_Сервисы.ФормаВыбора",
		ПараметрыОткрытия,
		,
		,
		,
		,
		ОписаниеВыбора,
		РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработатьВыборСервиса(РезультатЗакрытия, ДопПараметры) Экспорт
	
	Если Не ЗначениеЗаполнено(РезультатЗакрытия) Тогда
		Возврат;
	КонецЕсли;
	
	СоздатьШаблоныПоСервисНаСервере(РезультатЗакрытия);
	
	Элементы.Список.Обновить();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервереБезКонтекста
Процедура СоздатьШаблоныПоСервисНаСервере(Сервис)
	
	Справочники.кв_ШаблоныСервисов.СоздатьШаблоныПоСервису(Сервис);
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПометкаУдаления(Знач МассивОбъектов)
	
	Результат = Ложь;
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	кв_ШаблоныСервисов.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.кв_ШаблоныСервисов КАК кв_ШаблоныСервисов
	|ГДЕ
	|	кв_ШаблоныСервисов.Ссылка В (&МассивОбъектов)
	|	И кв_ШаблоныСервисов.ПометкаУдаления";
	Запрос.УстановитьПараметр("МассивОбъектов", МассивОбъектов);
	
	Результат = Не Запрос.Выполнить().Пустой();
	
	Возврат Результат;
	
КонецФункции

&НаСервереБезКонтекста
Процедура ПометитьНаУдалениеСнятьПометкуНаСервере(Знач МассивОбъектов, ТекущаяПометкаУдаления)
	
	Для Каждого Ссылка Из МассивОбъектов Цикл
		ТекущийОбъект = Ссылка.ПолучитьОбъект();
		Если ТекущийОбъект.ПометкаУдаления <> ТекущаяПометкаУдаления Тогда
			Продолжить;
		КонецЕсли;
		ТекущийОбъект.Заблокировать();
		ТекущийОбъект.УстановитьПометкуУдаления(Не ТекущаяПометкаУдаления);
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Функция ПоказатьВопросДаНетАсинх(ТекстВопроса, ПараметрыВопроса = Неопределено)
	
	Если ПараметрыВопроса = Неопределено Тогда
		ПараметрыВопроса = ПараметрыВопросаДаНет();
	КонецЕсли;
	
	Кнопки = Новый СписокЗначений;
	Если ПараметрыВопроса.ТекстКнопкиДа = "" Тогда
		Кнопки.Добавить(КодВозвратаДиалога.Да, НСтр("ru = 'Да'"));
	Иначе
		Кнопки.Добавить(КодВозвратаДиалога.Да, ПараметрыВопроса.ТекстКнопкиДа);
	КонецЕсли;
	Если ПараметрыВопроса.ТекстКнопкиНет = "" Тогда
		Кнопки.Добавить(КодВозвратаДиалога.Нет, НСтр("ru = 'Нет'"));
	Иначе
		Кнопки.Добавить(КодВозвратаДиалога.Нет, ПараметрыВопроса.ТекстКнопкиНет);
	КонецЕсли;
	
	Если ПараметрыВопроса.КнопкаПоУмолчанию = Неопределено Тогда
		Возврат ВопросАсинх(ТекстВопроса, Кнопки,,, ПараметрыВопроса.Заголовок);
	ИначеЕсли ПараметрыВопроса.КнопкаПоУмолчанию = КодВозвратаДиалога.Да Тогда
		Возврат ВопросАсинх(ТекстВопроса, Кнопки,, КодВозвратаДиалога.Да, ПараметрыВопроса.Заголовок);
	ИначеЕсли ПараметрыВопроса.КнопкаПоУмолчанию = КодВозвратаДиалога.Нет Тогда
		Возврат ВопросАсинх(ТекстВопроса, Кнопки,, КодВозвратаДиалога.Нет, ПараметрыВопроса.Заголовок);
	Иначе
		ВызватьИсключение СтрШаблон(НСтр("ru = 'Недопустимое значение кнопки по умолчанию: %1'"),
			ПараметрыВопроса.КнопкаПоУмолчанию);
	КонецЕсли;
	
КонецФункции

&НаКлиенте
Функция ПараметрыВопросаДаНет(КнопкаПоУмолчанию = Неопределено) Экспорт
	
	ПараметрыВопросаДаНет = Новый Структура;
	ПараметрыВопросаДаНет.Вставить("КнопкаПоУмолчанию", КнопкаПоУмолчанию);
	ПараметрыВопросаДаНет.Вставить("ТекстКнопкиДа", "");
	ПараметрыВопросаДаНет.Вставить("ТекстКнопкиНет", "");
	ПараметрыВопросаДаНет.Вставить("Заголовок", "");
	
	Возврат ПараметрыВопросаДаНет;
	
КонецФункции

#КонецОбласти