///////////////////////////////////////////////////////////////////////////////////////////////////////
// Copyright (c) 2022-2025, ООО 1С-Рарус
// Все права защищены. Эта программа и сопроводительные материалы предоставляются
// в соответствии с условиями лицензии Attribution-ShareAlike 4.0 International (CC BY-SA 4.0)
// Текст лицензии доступен по ссылке:
// https://creativecommons.org/licenses/by-sa/4.0/legalcode
//////////////////////////////////////////////////////////////////////////////////////////////////////

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ЗаполнитьСписокВыбораHTTPСервисов();
	
	кв_ОбщегоНазначения.ЗаписатьОперациюБизнесСтатистики("Сервисы");
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	НастроитьФормуНаКлиенте();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ИспользуетсяПриИзменении(Элемент)
	
	НастроитьФормуНаКлиенте();
	
КонецПроцедуры

&НаКлиенте
Процедура ЖурналированиеПриИзменении(Элемент)
	
	НастроитьФормуНаКлиенте();
	
КонецПроцедуры 

&НаКлиенте
Процедура РегистрироватьТелоОтветаПриИзменении(Элемент)
	
	НастроитьФормуНаКлиенте();
	
КонецПроцедуры

&НаКлиенте
Процедура ОбеспечениеИдемпотентностиПриИзменении(Элемент)
	
	НастроитьФормуНаКлиенте();
	
КонецПроцедуры 

&НаКлиенте
Процедура КонтрольКонфликтовЗапросовПриИзменении(Элемент)
	
	НастроитьФормуНаКлиенте();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ОткрытьОПрограмме(Команда)
	
	ОткрытьФорму("Справочник.кв_Сервисы.Форма.ОПрограмме", , ЭтотОбъект);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура НастроитьФормуНаКлиенте()
	
	Элементы.СтраницаЖурналВходящихЗапросов.ТолькоПросмотр = НЕ Объект.Используется;
	Элементы.СтраницаКонтрольЗапросов.ТолькоПросмотр = НЕ (Объект.Используется И Объект.Журналирование
		И Объект.РегистрироватьТелоОтвета);
	Элементы.ГруппаНастройкиЖурнала.ТолькоПросмотр = НЕ Объект.Журналирование;
	Элементы.КонтрольКонфликтовЗапросов.ТолькоПросмотр = НЕ Объект.ОбеспечениеИдемпотентности;
	Элементы.ГруппаРазблокировкаКонфликтов.ТолькоПросмотр = НЕ Объект.ОбеспечениеИдемпотентности
		Или НЕ Объект.КонтрольКонфликтовЗапросов;
	
	Если НЕ Объект.ОбеспечениеИдемпотентности Тогда
		Объект.КонтрольКонфликтовЗапросов = Ложь;
	КонецЕсли;
		
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьСписокВыбораHTTPСервисов()
	
	КартинкаHTTPСервисы = Элементы.КартинкаМетаданныеHTTPСервисы.Картинка;
	
	Для каждого Сервис Из Метаданные.HTTPСервисы Цикл
		Если ПустаяСтрока(Сервис.КорневойURL) Тогда
			Продолжить;
		КонецЕсли;
		
		Элементы.Наименование.СписокВыбора.Добавить(Сервис.КорневойURL, , , КартинкаHTTPСервисы);
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти
