///////////////////////////////////////////////////////////////////////////////////////////////////////
// Copyright (c) 2022-2025, ООО 1С-Рарус
// Все права защищены. Эта программа и сопроводительные материалы предоставляются
// в соответствии с условиями лицензии Attribution-ShareAlike 4.0 International (CC BY-SA 4.0)
// Текст лицензии доступен по ссылке:
// https://creativecommons.org/licenses/by-sa/4.0/legalcode
//////////////////////////////////////////////////////////////////////////////////////////////////////

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	КонстантыНабор.кв_ИспользоватьРегламентныеЗадания = Константы.кв_ИспользоватьРегламентныеЗадания.Получить();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаСервере
Процедура ИспользоватьРегламентныеЗаданияПриИзмененииНаСервере()
	
	Константы.кв_ИспользоватьРегламентныеЗадания.Установить(КонстантыНабор.кв_ИспользоватьРегламентныеЗадания);
	
КонецПроцедуры

&НаКлиенте
Процедура ИспользоватьРегламентныеЗаданияПриИзменении(Элемент)
	
	ИспользоватьРегламентныеЗаданияПриИзмененииНаСервере();
	
КонецПроцедуры

#КонецОбласти
